app/controllers/videos_controller.rb

INSERT INTO "videos" ("description", "video", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "Video1"], ["video", "actions.png"], ["created_at", "2015-11-28 14:06:07.029504"], ["updated_at", "2015-11-28 14:06:07.029504"]]
---
  def create
    @video = Video.new(video_params)

    respond_to do |format|
      if @video.save

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT 1  [["id", 13]]
---
    def set_video
      @video = Video.find(params[:id])